app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("attachment", "name", "user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["attachment", "ray-ban.jpg"], ["name", "rayban"], ["user_id", 1], ["description", "best day ever"], ["created_at", "2015-03-27 15:48:57.389026"], ["updated_at", "2015-03-27 15:48:57.389026"]]
---
  def create
    pattern = {attachment: true, name: true, user_id: true, description: false}
    if safe_params = valid_params(pattern, params)
      picture = Picture.new(:attachment => params[:attachment], :name => params[:name], :user_id => params[:user_id], :description => params[:description])
      if picture.save

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 14]]
---
  def delete
    pattern = {id: true}

    if safe_params = valid_params(pattern, params)
        if picture = valid_object(Picture, safe_params[:id])
            picture.destroy