app/controllers/registrations_controller.rb

    def delete
      pattern = {id: true}

      if safe_params = valid_params(pattern, params.except(:user_email, :user_token))
          if user = valid_object(User, safe_params[:id])
              user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]