app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "authentication_token", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      user = User.new(:email => params[:email], :password => params[:password])
      if user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "titi@yopmail.com"]]
---
    def resend_confirmation
      pattern = {user_email:true}

      if safe_params = valid_params(pattern, params)
          if user = User.where(:email => safe_params[:user_email]).first