app/controllers/sessions_controller.rb

  def create
    # Fetch params
    email = params[:email] || params[:user][:email]
    password = params[:password] || params[:user][:password]

    id = User.find_by(email: email).try(:id) if email.presence
    if email.nil? or password.nil?
      render status: 400, json: { message: 'The request MUST contain the user email and password.' }
      return
    end

    if !id
      render status: 400, json: { message: 'This user does not exists' }
      return
    elsif !User.find(id).confirmed?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "cpsnoobie@gmail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]