app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "cpsnoobie@gmail.com"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
    def delete
      pattern = {user_email:true, user_token:true}

      if safe_params = valid_params(pattern, params)
          if user = User.where(:email => safe_params[:user_email]).first
            user.delete