app/controllers/videos_controller.rb

INSERT INTO "videos" ("attachment", "name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    pattern = {attachment: true, name: true, user_id: true, description: false}
    if safe_params = valid_params(pattern, params)
      video = Video.new(:attachment => params[:attachment], :name => params[:name], :user_id => params[:user_id], :description => params[:description])
      if video.save